In [1]:
# Data Visualizations
# 1) Software/tech jobs split up by state (identify lowest steps)
# 2) Software/tech jobs split up by city in the midwestern states 
# 3) Number of software/tech students per Midwestern university

In [2]:
# Data Source(s):
# US Bureau of Labor Statistics (May 2019)
# National Center for Education Statistics (NCES) (2018-2019)

In [3]:
import os.path
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

In [4]:
data = "/Users/skasralikar/Desktop/github/rmds/datasets"
state = pd.read_csv(os.path.join(data,'job_state.csv'), sep =',')
city = pd.read_csv(os.path.join(data, 'job_city.csv'), sep =',')
majors = pd.read_csv(os.path.join(data, 'CS_majors.csv'), sep = ',')
statecode = pd.read_csv(os.path.join(data, 'state_code.csv'),sep = ',')

In [5]:
state.isnull().any()
city.isnull().any()

area_title    False
City          False
State         False
State          True
occ_title     False
tot_emp       False
dtype: bool

In [6]:
majors.isnull().any()

UnitID                                                              False
Institution Name                                                    False
FIPS state code (HD2018)                                            False
Grand total (EF2018CP  14.0000-Engineering  Undergraduate total)     True
Unnamed: 4                                                           True
dtype: bool

In [7]:
#define tech values
tech = "Computer and Information Systems Managers|Computer and Mathematical Occupations|Computer Occupations, All Other"

In [8]:
#filter out tech jobs from original dataframe
statetech = state[state['occ_title'].str.contains(tech)]

In [9]:
#job_state.csv string values into numerical

#strip unwanted string values
statetech['tot_emp'] = statetech['tot_emp'].str.rstrip('**')
statetech['tot_emp'] = statetech['tot_emp'].str.replace(',','')

#convert string into integer and replace NaN vals with 0
statetech['tot_emp'] = pd.to_numeric(statetech['tot_emp'], errors ='coerce')
statetech = statetech.replace(np.nan, 0, regex=True)

#sum tech jobs per state
statetech = statetech.groupby(['area_title']).sum()

/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.
/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [10]:
statetech

                       tot_emp
area_title
Alabama                49960.0
Alaska                  6200.0
Arizona               114620.0
Arkansas               25580.0
California            803270.0
Colorado              144970.0
Connecticut            59420.0
Delaware               17870.0
District of Columbia   47690.0
Florida               249190.0
Georgia               191840.0
Guam                     890.0
Hawaii                 13580.0
Idaho                  18400.0
Illinois              219270.0
Indiana                70920.0
Iowa                   44150.0
Kansas                 41080.0
Kentucky               39750.0
Louisiana              26350.0
Maine                  14470.0
Maryland              160270.0
Massachusetts         166820.0
Michigan              132540.0
Minnesota             113070.0
Mississippi            15090.0
Missouri               95070.0
Montana                 9970.0
Nebraska               37150.0
Nevada                 26270.0
New Hampshire          26820.0
New Jersey            170060.0
New Mexico             18550.0
New York              306390.0
North Carolina        163810.0
North Dakota            8570.0
Ohio                  180870.0
Oklahoma               38080.0
Oregon                 64710.0
Pennsylvania          196720.0
Puerto Rico            14410.0
Rhode Island           17590.0
South Carolina         48990.0
South Dakota            8850.0
Tennessee              71060.0
Texas                 439890.0
Utah                   69790.0
Vermont                 8060.0
Virgin Islands           480.0
Virginia              244720.0
Washington            198930.0
West Virginia          14520.0
Wisconsin              87950.0
Wyoming                 3560.0

In [11]:
citytech = city[city['occ_title'].str.contains(tech)]

In [12]:
citytech = citytech.drop(['City', 'State'], axis = 1)

In [13]:
#city_state.csv string values into numerical

#strip unwanted string values
citytech['tot_emp'] = citytech['tot_emp'].str.rstrip('**')
citytech['tot_emp'] = citytech['tot_emp'].str.replace(',','')

#convert string into integer and replace NaN vals with 0
citytech['tot_emp'] = pd.to_numeric(citytech['tot_emp'], errors ='coerce')
citytech = citytech.replace(np.nan, 0, regex=True)

#sum tech jobs per city per state
citytech = citytech.groupby(['area_title']).sum()

In [14]:
citytech

                                   tot_emp
area_title
Abilene, TX                          720.0
Aguadilla-Isabela, PR               1010.0
Akron, OH                          10970.0
Albany, GA                           880.0
Albany, OR                           390.0
...                                    ...
Yakima, WA                           890.0
York-Hanover, PA                    3660.0
Youngstown-Warren-Boardman, OH-PA   2500.0
Yuba City, CA                        500.0
Yuma, AZ                             930.0

[395 rows x 1 columns]

In [15]:
majors

,UnitID,Institution Name,FIPS state code (HD2018),Grand total (EF2018CP 14.0000-Engineering Undergraduate total),Unnamed: 4
0,177834,A T Still University of Health Sciences,29,NaN,NaN
1,180203,Aaniiih Nakoda College,30,NaN,NaN
2,491464,ABC Adult School,6,NaN,NaN
3,493105,ABC Adult School - Cabrillo Lane,6,NaN,NaN
4,459523,ABC Beauty Academy,48,NaN,NaN
...,...,...,...,...,...
6697,413820,Yukon Beauty College Inc,40,NaN,NaN
6698,451237,Z Hair Academy,20,NaN,NaN
6699,204255,Zane State College,39,NaN,NaN
6700,458575,Zaytuna College,6,NaN,NaN
6701,486248,ZMS The Academy,6,NaN,NaN

In [16]:
majors.isnull().any()

UnitID                                                              False
Institution Name                                                    False
FIPS state code (HD2018)                                            False
Grand total (EF2018CP  14.0000-Engineering  Undergraduate total)     True
Unnamed: 4                                                           True
dtype: bool

In [17]:
majors = majors.drop(['UnitID', 'Unnamed: 4'], axis = 1)
majors = majors.replace(np.nan, 0, regex=True)

In [18]:
majors

,Institution Name,FIPS state code (HD2018),Grand total (EF2018CP 14.0000-Engineering Undergraduate total)
0,A T Still University of Health Sciences,29,0.0
1,Aaniiih Nakoda College,30,0.0
2,ABC Adult School,6,0.0
3,ABC Adult School - Cabrillo Lane,6,0.0
4,ABC Beauty Academy,48,0.0
...,...,...,...
6697,Yukon Beauty College Inc,40,0.0
6698,Z Hair Academy,20,0.0
6699,Zane State College,39,0.0
6700,Zaytuna College,6,0.0
6701,ZMS The Academy,6,0.0

In [ ]:
#graph time